In [12]:
import numpy as np
import pandas as pd

## 1.Create a pandas dataframe (DataFrame name as 'df') with numpy random values (4 features and 4 observation).

In [13]:
s1=pd.Series(np.random.randint(40,100,size=4))
s2=pd.Series(np.random.randint(40,100,size=4))
s3=pd.Series(np.random.randint(40,100,size=4))
s4=pd.Series(np.random.randint(40,100,size=4))

In [14]:
print(s1)
print(s2)
print(s3)
print(s4)

0    63
1    59
2    47
3    58
dtype: int32
0    61
1    55
2    65
3    68
dtype: int32
0    53
1    88
2    61
3    58
dtype: int32
0    96
1    86
2    76
3    68
dtype: int32

In [15]:
df=pd.DataFrame({"DBMS":s1,"OOPS":s2,"Networks":s3,"Data science":s4})
df

   DBMS  OOPS  Networks  Data science
0    63    61        53            96
1    59    55        88            86
2    47    65        61            76
3    58    68        58            68

## 2.Rename the task - 1 'df' dataframe column names to 'Random value 1', 'Random value 2', 'Random value 3' & 'Random value 4'

In [16]:
df.columns=['Random value 1','Random value 2','Random value 3','Random value 4']
df

   Random value 1  Random value 2  Random value 3  Random value 4
0              63              61              53              96
1              59              55              88              86
2              47              65              61              76
3              58              68              58              68

## 3.Find the descriptive statistics of the 'df' dataframe

In [17]:
df.describe(include='all')

       Random value 1  Random value 2  Random value 3  Random value 4
count        4.000000        4.000000        4.000000        4.000000
mean        56.750000       62.250000       65.000000       81.500000
std          6.849574        5.619905       15.684387       12.151817
min         47.000000       55.000000       53.000000       68.000000
25%         55.250000       59.500000       56.750000       74.000000
50%         58.500000       63.000000       59.500000       81.000000
75%         60.000000       65.750000       67.750000       88.500000
max         63.000000       68.000000       88.000000       96.000000

## 4.Check for the null values in 'df' and find the data type of the columns.

In [18]:
df.isnull()

   Random value 1  Random value 2  Random value 3  Random value 4
0           False           False           False           False
1           False           False           False           False
2           False           False           False           False
3           False           False           False           False

In [19]:
df.dtypes

Random value 1    int32
Random value 2    int32
Random value 3    int32
Random value 4    int32
dtype: object

In [20]:
df['Random value 1'].dtypes

dtype('int32')

## 5.Display the 'Random value 2' & 'Random value 3' columns with location method and index location method

In [21]:
df.loc[0:4,"Random value 2":"Random value 3"]

   Random value 2  Random value 3
0              61              53
1              55              88
2              65              61
3              68              58

In [22]:
df.iloc[0:4,1:3]

   Random value 2  Random value 3
0              61              53
1              55              88
2              65              61
3              68              58